# Terraform environment at24
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_virtual_network.hub_vnet: Reading...
data.azurerm_private_dns_zone.hub_service_bus: Reading...
data.azurerm_virtual_network.hub_vnet: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
data.azurerm_private_dns_zone.hub_service_bus: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.spoke has been deleted
  - resource "azurerm_resource_group" "spoke" {
        id       = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24"
      - location = "norwayeast" -> null
      - name     = "rgaltinnauth001at24" -> null
        tags     = {
            "CreatedAt"   = "2025-01-16T09:21:47Z"
            "Environment" = "at24"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_insights.telemetry will be created
  + resource "azurerm_application_insights" "telemetry" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "norwayeast"
      + name                                = "aialtinnauth001at24"
      + resource_group_name                 = "rgaltinnauth001at24"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + workspace_id                        = (known after apply)
    }

  # azurerm_log_analytics_workspace.telemetry will be created
  + resource "azurerm_log_analytics_workspace" "telemetry" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "norwayeast"
      + name                            = "logaltinnauth001at24"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rgaltinnauth001at24"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # azurerm_resource_group.spoke will be created
  + resource "azurerm_resource_group" "spoke" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "rgaltinnauth001at24"
      + tags     = {
          + "CreatedAt"   = "2025-01-16T09:21:47Z"
          + "Environment" = "at24"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }
    }

  # azurerm_route_table.forced_tunneling will be created
  + resource "azurerm_route_table" "forced_tunneling" {
      + bgp_route_propagation_enabled = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "rtftaltinnauth001at24"
      + resource_group_name           = "rgaltinnauth001at24"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/0"
              + name                   = "IPv4ForcedTunneling"
              + next_hop_in_ip_address = "10.202.19.4"
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
    }

  # azurerm_servicebus_namespace.service_bus will be created
  + resource "azurerm_servicebus_namespace" "service_bus" {
      + capacity                            = 0
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "norwayeast"
      + minimum_tls_version                 = "1.2"
      + name                                = "sbaltinnaltinnauth001at24"
      + premium_messaging_partitions        = 0
      + public_network_access_enabled       = true
      + resource_group_name                 = "rgaltinnauth001at24"
      + sku                                 = "Standard"
      + tags                                = {
          + "CreatedAt"   = "2025-01-16T09:21:47Z"
          + "Environment" = "at24"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_rule_set {
          + default_action                = "Deny"
          + ip_rules                      = [
              + "51.120.88.253",
            ]
          + public_network_access_enabled = true
          + trusted_services_allowed      = true
        }
    }

  # azurerm_subnet.dual_stack["Default"] will be created
  + resource "azurerm_subnet" "dual_stack" {
      + address_prefixes                              = [
          + "10.202.144.0/22",
          + "fd0a:7204:c37f:8000::/64",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "Default"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgaltinnauth001at24"
      + virtual_network_name                          = "vnetdsaltinnauth001at24"
    }

  # azurerm_subnet.dual_stack["ServiceBus"] will be created
  + resource "azurerm_subnet" "dual_stack" {
      + address_prefixes                              = [
          + "10.202.152.0/25",
          + "fd0a:7204:c37f:8002::/64",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "ServiceBus"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgaltinnauth001at24"
      + virtual_network_name                          = "vnetdsaltinnauth001at24"
    }

  # azurerm_subnet.single_stack["Postgres"] will be created
  + resource "azurerm_subnet" "single_stack" {
      + address_prefixes                              = [
          + "10.202.128.0/22",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "Postgres"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgaltinnauth001at24"
      + virtual_network_name                          = "vnetssaltinnauth001at24"
    }

  # azurerm_virtual_network.dual_stack will be created
  + resource "azurerm_virtual_network" "dual_stack" {
      + address_space       = [
          + "10.202.144.0/20",
          + "fd0a:7204:c37f:8000::/51",
        ]
      + dns_servers         = [
          + "10.202.19.4",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "vnetdsaltinnauth001at24"
      + resource_group_name = "rgaltinnauth001at24"
      + subnet              = (known after apply)
      + tags                = {
          + "AksIPv4"        = "10.202.148.0/22"
          + "AksIPv6"        = "fd0a:7204:c37f:8001::/64"
          + "CreatedAt"      = "2025-01-16T09:21:47Z"
          + "DefaultIPv4"    = "10.202.144.0/22"
          + "DefaultIPv6"    = "fd0a:7204:c37f:8000::/64"
          + "Environment"    = "at24"
          + "Instance"       = "001"
          + "ProductName"    = "auth"
          + "ServiceBusIPv4" = "10.202.152.0/25"
          + "ServiceBusIPv6" = "fd0a:7204:c37f:8002::/64"
        }
    }

  # azurerm_virtual_network.single_stack will be created
  + resource "azurerm_virtual_network" "single_stack" {
      + address_space       = [
          + "10.202.128.0/20",
        ]
      + dns_servers         = [
          + "10.202.19.4",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "vnetssaltinnauth001at24"
      + resource_group_name = "rgaltinnauth001at24"
      + subnet              = (known after apply)
      + tags                = {
          + "CreatedAt"    = "2025-01-16T09:21:47Z"
          + "Environment"  = "at24"
          + "Instance"     = "001"
          + "PostgresIPv4" = "10.202.128.0/22"
          + "ProductName"  = "auth"
        }
    }

  # azurerm_virtual_network_peering.hub_to_spoke_dual_stack will be created
  + resource "azurerm_virtual_network_peering" "hub_to_spoke_dual_stack" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = true
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "spoke-dual-stack-at24"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rgaltinnauth001hub"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnetaltinnauth001hub"
    }

  # azurerm_virtual_network_peering.hub_to_spoke_single_stack will be created
  + resource "azurerm_virtual_network_peering" "hub_to_spoke_single_stack" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = true
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "spoke-single-stack-at24"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rgaltinnauth001hub"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnetaltinnauth001hub"
    }

  # azurerm_virtual_network_peering.spoke_to_hub_dual_stack will be created
  + resource "azurerm_virtual_network_peering" "spoke_to_hub_dual_stack" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "hub"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub"
      + resource_group_name                    = "rgaltinnauth001at24"
      + use_remote_gateways                    = true
      + virtual_network_name                   = "vnetdsaltinnauth001at24"
    }

  # azurerm_virtual_network_peering.spoke_to_hub_single_stack will be created
  + resource "azurerm_virtual_network_peering" "spoke_to_hub_single_stack" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "hub"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub"
      + resource_group_name                    = "rgaltinnauth001at24"
      + use_remote_gateways                    = true
      + virtual_network_name                   = "vnetssaltinnauth001at24"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/spoke` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/at24/spokes.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_at24_spokes.tfstate.tfplan`